cat-matching-game-backend/app/controllers/scores_controller.rb

SELECT "scores".* FROM "scores"
---
    def index
        scores = Score.all

SELECT "scores".* FROM "scores" WHERE "scores"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        score = Score.find_by_id(params[:id])

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES (?, ?, ?)  [["username", "msl"], ["created_at", "2021-02-02 22:53:59.046403"], ["updated_at", "2021-02-02 22:53:59.046403"]]
INSERT INTO "scores" ("user_score", "user_initials", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_score", 253], ["user_initials", 0], ["user_id", 3], ["created_at", "2021-02-02 22:53:59.086401"], ["updated_at", "2021-02-02 22:53:59.086401"]]
---
    def create
        user = User.find_or_create_by(user_params)
       score = user.scores.build(scores_params)
       if user.save && score.save