cat-matching-game-backend/app/controllers/users_controller.rb

    def index
        users = User.all
---
SELECT "users".* FROM "users"

    def show
        user = User.find_by_id(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]

    def create
        user = User.create(user_params)
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES (?, ?, ?)  [["username", "sig"], ["created_at", "2021-02-03 19:07:14.148876"], ["updated_at", "2021-02-03 19:07:14.148876"]]